Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_bf.h
/**
 * \file IfxInt_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC39XA_ITS_V3.0.R0
 * Specification: TC39xA_INT_ITS_MCSFR.xml
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Int_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Int
 * 
 */
#ifndef IFXINT_BF_H
#define IFXINT_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_BitfieldsMask
 * \{  */

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN0 */
#define IFX_INT_ACCEN_CONFIG0_EN0_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN0 */
#define IFX_INT_ACCEN_CONFIG0_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN0 */
#define IFX_INT_ACCEN_CONFIG0_EN0_OFF (0u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN10 */
#define IFX_INT_ACCEN_CONFIG0_EN10_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN10 */
#define IFX_INT_ACCEN_CONFIG0_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN10 */
#define IFX_INT_ACCEN_CONFIG0_EN10_OFF (10u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN11 */
#define IFX_INT_ACCEN_CONFIG0_EN11_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN11 */
#define IFX_INT_ACCEN_CONFIG0_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN11 */
#define IFX_INT_ACCEN_CONFIG0_EN11_OFF (11u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN12 */
#define IFX_INT_ACCEN_CONFIG0_EN12_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN12 */
#define IFX_INT_ACCEN_CONFIG0_EN12_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN12 */
#define IFX_INT_ACCEN_CONFIG0_EN12_OFF (12u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN13 */
#define IFX_INT_ACCEN_CONFIG0_EN13_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN13 */
#define IFX_INT_ACCEN_CONFIG0_EN13_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN13 */
#define IFX_INT_ACCEN_CONFIG0_EN13_OFF (13u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN14 */
#define IFX_INT_ACCEN_CONFIG0_EN14_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN14 */
#define IFX_INT_ACCEN_CONFIG0_EN14_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN14 */
#define IFX_INT_ACCEN_CONFIG0_EN14_OFF (14u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN15 */
#define IFX_INT_ACCEN_CONFIG0_EN15_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN15 */
#define IFX_INT_ACCEN_CONFIG0_EN15_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN15 */
#define IFX_INT_ACCEN_CONFIG0_EN15_OFF (15u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN16 */
#define IFX_INT_ACCEN_CONFIG0_EN16_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN16 */
#define IFX_INT_ACCEN_CONFIG0_EN16_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN16 */
#define IFX_INT_ACCEN_CONFIG0_EN16_OFF (16u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN17 */
#define IFX_INT_ACCEN_CONFIG0_EN17_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN17 */
#define IFX_INT_ACCEN_CONFIG0_EN17_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN17 */
#define IFX_INT_ACCEN_CONFIG0_EN17_OFF (17u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN18 */
#define IFX_INT_ACCEN_CONFIG0_EN18_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN18 */
#define IFX_INT_ACCEN_CONFIG0_EN18_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN18 */
#define IFX_INT_ACCEN_CONFIG0_EN18_OFF (18u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN19 */
#define IFX_INT_ACCEN_CONFIG0_EN19_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN19 */
#define IFX_INT_ACCEN_CONFIG0_EN19_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN19 */
#define IFX_INT_ACCEN_CONFIG0_EN19_OFF (19u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN1 */
#define IFX_INT_ACCEN_CONFIG0_EN1_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN1 */
#define IFX_INT_ACCEN_CONFIG0_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN1 */
#define IFX_INT_ACCEN_CONFIG0_EN1_OFF (1u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN20 */
#define IFX_INT_ACCEN_CONFIG0_EN20_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN20 */
#define IFX_INT_ACCEN_CONFIG0_EN20_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN20 */
#define IFX_INT_ACCEN_CONFIG0_EN20_OFF (20u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN21 */
#define IFX_INT_ACCEN_CONFIG0_EN21_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN21 */
#define IFX_INT_ACCEN_CONFIG0_EN21_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN21 */
#define IFX_INT_ACCEN_CONFIG0_EN21_OFF (21u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN22 */
#define IFX_INT_ACCEN_CONFIG0_EN22_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN22 */
#define IFX_INT_ACCEN_CONFIG0_EN22_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_CONFIG0_Bits.EN22 */
#define IFX_INT_ACCEN_CONFIG0_EN22_OFF (22u)

/** \brief  Length for Ifx_INT_ACCEN_CONFIG0_Bits.EN23 */
#define IFX_INT_ACCEN_CONFIG0_EN23_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_CONFIG0_Bits.EN23 */
#define IFX_INT_ACCEN_CONFIG0_EN23_MSK (0x1u)

