Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_bf.h
/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN26 */
#define IFX_INT_ACCEN_SRB50_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN26 */
#define IFX_INT_ACCEN_SRB50_EN26_OFF (26u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN27 */
#define IFX_INT_ACCEN_SRB50_EN27_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN27 */
#define IFX_INT_ACCEN_SRB50_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN27 */
#define IFX_INT_ACCEN_SRB50_EN27_OFF (27u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN28 */
#define IFX_INT_ACCEN_SRB50_EN28_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN28 */
#define IFX_INT_ACCEN_SRB50_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN28 */
#define IFX_INT_ACCEN_SRB50_EN28_OFF (28u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN29 */
#define IFX_INT_ACCEN_SRB50_EN29_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN29 */
#define IFX_INT_ACCEN_SRB50_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN29 */
#define IFX_INT_ACCEN_SRB50_EN29_OFF (29u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN2 */
#define IFX_INT_ACCEN_SRB50_EN2_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN2 */
#define IFX_INT_ACCEN_SRB50_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN2 */
#define IFX_INT_ACCEN_SRB50_EN2_OFF (2u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN30 */
#define IFX_INT_ACCEN_SRB50_EN30_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN30 */
#define IFX_INT_ACCEN_SRB50_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN30 */
#define IFX_INT_ACCEN_SRB50_EN30_OFF (30u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN31 */
#define IFX_INT_ACCEN_SRB50_EN31_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN31 */
#define IFX_INT_ACCEN_SRB50_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN31 */
#define IFX_INT_ACCEN_SRB50_EN31_OFF (31u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN3 */
#define IFX_INT_ACCEN_SRB50_EN3_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN3 */
#define IFX_INT_ACCEN_SRB50_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN3 */
#define IFX_INT_ACCEN_SRB50_EN3_OFF (3u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN4 */
#define IFX_INT_ACCEN_SRB50_EN4_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN4 */
#define IFX_INT_ACCEN_SRB50_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN4 */
#define IFX_INT_ACCEN_SRB50_EN4_OFF (4u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN5 */
#define IFX_INT_ACCEN_SRB50_EN5_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN5 */
#define IFX_INT_ACCEN_SRB50_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN5 */
#define IFX_INT_ACCEN_SRB50_EN5_OFF (5u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN6 */
#define IFX_INT_ACCEN_SRB50_EN6_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN6 */
#define IFX_INT_ACCEN_SRB50_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN6 */
#define IFX_INT_ACCEN_SRB50_EN6_OFF (6u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN7 */
#define IFX_INT_ACCEN_SRB50_EN7_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN7 */
#define IFX_INT_ACCEN_SRB50_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN7 */
#define IFX_INT_ACCEN_SRB50_EN7_OFF (7u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN8 */
#define IFX_INT_ACCEN_SRB50_EN8_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN8 */
#define IFX_INT_ACCEN_SRB50_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN8 */
#define IFX_INT_ACCEN_SRB50_EN8_OFF (8u)

/** \brief  Length for Ifx_INT_ACCEN_SRB50_Bits.EN9 */
#define IFX_INT_ACCEN_SRB50_EN9_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRB50_Bits.EN9 */
#define IFX_INT_ACCEN_SRB50_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRB50_Bits.EN9 */
#define IFX_INT_ACCEN_SRB50_EN9_OFF (9u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN0 */
#define IFX_INT_ACCEN_SRC_TOS00_EN0_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN0 */
#define IFX_INT_ACCEN_SRC_TOS00_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN0 */
#define IFX_INT_ACCEN_SRC_TOS00_EN0_OFF (0u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN10 */
#define IFX_INT_ACCEN_SRC_TOS00_EN10_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN10 */
#define IFX_INT_ACCEN_SRC_TOS00_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN10 */
#define IFX_INT_ACCEN_SRC_TOS00_EN10_OFF (10u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN11 */
#define IFX_INT_ACCEN_SRC_TOS00_EN11_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN11 */
#define IFX_INT_ACCEN_SRC_TOS00_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN11 */
#define IFX_INT_ACCEN_SRC_TOS00_EN11_OFF (11u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN12 */
#define IFX_INT_ACCEN_SRC_TOS00_EN12_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN12 */
#define IFX_INT_ACCEN_SRC_TOS00_EN12_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN12 */
#define IFX_INT_ACCEN_SRC_TOS00_EN12_OFF (12u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN13 */
#define IFX_INT_ACCEN_SRC_TOS00_EN13_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN13 */
#define IFX_INT_ACCEN_SRC_TOS00_EN13_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN13 */
#define IFX_INT_ACCEN_SRC_TOS00_EN13_OFF (13u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN14 */
#define IFX_INT_ACCEN_SRC_TOS00_EN14_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN14 */
#define IFX_INT_ACCEN_SRC_TOS00_EN14_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN14 */
#define IFX_INT_ACCEN_SRC_TOS00_EN14_OFF (14u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS00_Bits.EN15 */
#define IFX_INT_ACCEN_SRC_TOS00_EN15_LEN (1u)

