Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_bf.h
/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN10 */
#define IFX_INT_ACCEN_SRC_TOS60_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN10 */
#define IFX_INT_ACCEN_SRC_TOS60_EN10_OFF (10u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN11 */
#define IFX_INT_ACCEN_SRC_TOS60_EN11_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN11 */
#define IFX_INT_ACCEN_SRC_TOS60_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN11 */
#define IFX_INT_ACCEN_SRC_TOS60_EN11_OFF (11u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN12 */
#define IFX_INT_ACCEN_SRC_TOS60_EN12_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN12 */
#define IFX_INT_ACCEN_SRC_TOS60_EN12_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN12 */
#define IFX_INT_ACCEN_SRC_TOS60_EN12_OFF (12u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN13 */
#define IFX_INT_ACCEN_SRC_TOS60_EN13_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN13 */
#define IFX_INT_ACCEN_SRC_TOS60_EN13_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN13 */
#define IFX_INT_ACCEN_SRC_TOS60_EN13_OFF (13u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN14 */
#define IFX_INT_ACCEN_SRC_TOS60_EN14_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN14 */
#define IFX_INT_ACCEN_SRC_TOS60_EN14_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN14 */
#define IFX_INT_ACCEN_SRC_TOS60_EN14_OFF (14u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN15 */
#define IFX_INT_ACCEN_SRC_TOS60_EN15_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN15 */
#define IFX_INT_ACCEN_SRC_TOS60_EN15_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN15 */
#define IFX_INT_ACCEN_SRC_TOS60_EN15_OFF (15u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN16 */
#define IFX_INT_ACCEN_SRC_TOS60_EN16_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN16 */
#define IFX_INT_ACCEN_SRC_TOS60_EN16_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN16 */
#define IFX_INT_ACCEN_SRC_TOS60_EN16_OFF (16u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN17 */
#define IFX_INT_ACCEN_SRC_TOS60_EN17_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN17 */
#define IFX_INT_ACCEN_SRC_TOS60_EN17_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN17 */
#define IFX_INT_ACCEN_SRC_TOS60_EN17_OFF (17u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN18 */
#define IFX_INT_ACCEN_SRC_TOS60_EN18_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN18 */
#define IFX_INT_ACCEN_SRC_TOS60_EN18_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN18 */
#define IFX_INT_ACCEN_SRC_TOS60_EN18_OFF (18u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN19 */
#define IFX_INT_ACCEN_SRC_TOS60_EN19_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN19 */
#define IFX_INT_ACCEN_SRC_TOS60_EN19_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN19 */
#define IFX_INT_ACCEN_SRC_TOS60_EN19_OFF (19u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN1 */
#define IFX_INT_ACCEN_SRC_TOS60_EN1_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN1 */
#define IFX_INT_ACCEN_SRC_TOS60_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN1 */
#define IFX_INT_ACCEN_SRC_TOS60_EN1_OFF (1u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN20 */
#define IFX_INT_ACCEN_SRC_TOS60_EN20_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN20 */
#define IFX_INT_ACCEN_SRC_TOS60_EN20_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN20 */
#define IFX_INT_ACCEN_SRC_TOS60_EN20_OFF (20u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN21 */
#define IFX_INT_ACCEN_SRC_TOS60_EN21_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN21 */
#define IFX_INT_ACCEN_SRC_TOS60_EN21_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN21 */
#define IFX_INT_ACCEN_SRC_TOS60_EN21_OFF (21u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN22 */
#define IFX_INT_ACCEN_SRC_TOS60_EN22_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN22 */
#define IFX_INT_ACCEN_SRC_TOS60_EN22_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN22 */
#define IFX_INT_ACCEN_SRC_TOS60_EN22_OFF (22u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN23 */
#define IFX_INT_ACCEN_SRC_TOS60_EN23_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN23 */
#define IFX_INT_ACCEN_SRC_TOS60_EN23_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN23 */
#define IFX_INT_ACCEN_SRC_TOS60_EN23_OFF (23u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN24 */
#define IFX_INT_ACCEN_SRC_TOS60_EN24_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN24 */
#define IFX_INT_ACCEN_SRC_TOS60_EN24_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN24 */
#define IFX_INT_ACCEN_SRC_TOS60_EN24_OFF (24u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN25 */
#define IFX_INT_ACCEN_SRC_TOS60_EN25_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN25 */
#define IFX_INT_ACCEN_SRC_TOS60_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN25 */
#define IFX_INT_ACCEN_SRC_TOS60_EN25_OFF (25u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN26 */
#define IFX_INT_ACCEN_SRC_TOS60_EN26_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN26 */
#define IFX_INT_ACCEN_SRC_TOS60_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN26 */
#define IFX_INT_ACCEN_SRC_TOS60_EN26_OFF (26u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN27 */
#define IFX_INT_ACCEN_SRC_TOS60_EN27_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN27 */
#define IFX_INT_ACCEN_SRC_TOS60_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN27 */
#define IFX_INT_ACCEN_SRC_TOS60_EN27_OFF (27u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN28 */
#define IFX_INT_ACCEN_SRC_TOS60_EN28_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS60_Bits.EN28 */
#define IFX_INT_ACCEN_SRC_TOS60_EN28_MSK (0x1u)

