Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_bf.h
/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN18 */
#define IFX_INT_ACCEN_SRC_TOS70_EN18_OFF (18u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN19 */
#define IFX_INT_ACCEN_SRC_TOS70_EN19_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN19 */
#define IFX_INT_ACCEN_SRC_TOS70_EN19_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN19 */
#define IFX_INT_ACCEN_SRC_TOS70_EN19_OFF (19u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN1 */
#define IFX_INT_ACCEN_SRC_TOS70_EN1_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN1 */
#define IFX_INT_ACCEN_SRC_TOS70_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN1 */
#define IFX_INT_ACCEN_SRC_TOS70_EN1_OFF (1u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN20 */
#define IFX_INT_ACCEN_SRC_TOS70_EN20_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN20 */
#define IFX_INT_ACCEN_SRC_TOS70_EN20_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN20 */
#define IFX_INT_ACCEN_SRC_TOS70_EN20_OFF (20u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN21 */
#define IFX_INT_ACCEN_SRC_TOS70_EN21_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN21 */
#define IFX_INT_ACCEN_SRC_TOS70_EN21_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN21 */
#define IFX_INT_ACCEN_SRC_TOS70_EN21_OFF (21u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN22 */
#define IFX_INT_ACCEN_SRC_TOS70_EN22_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN22 */
#define IFX_INT_ACCEN_SRC_TOS70_EN22_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN22 */
#define IFX_INT_ACCEN_SRC_TOS70_EN22_OFF (22u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN23 */
#define IFX_INT_ACCEN_SRC_TOS70_EN23_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN23 */
#define IFX_INT_ACCEN_SRC_TOS70_EN23_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN23 */
#define IFX_INT_ACCEN_SRC_TOS70_EN23_OFF (23u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN24 */
#define IFX_INT_ACCEN_SRC_TOS70_EN24_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN24 */
#define IFX_INT_ACCEN_SRC_TOS70_EN24_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN24 */
#define IFX_INT_ACCEN_SRC_TOS70_EN24_OFF (24u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN25 */
#define IFX_INT_ACCEN_SRC_TOS70_EN25_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN25 */
#define IFX_INT_ACCEN_SRC_TOS70_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN25 */
#define IFX_INT_ACCEN_SRC_TOS70_EN25_OFF (25u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN26 */
#define IFX_INT_ACCEN_SRC_TOS70_EN26_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN26 */
#define IFX_INT_ACCEN_SRC_TOS70_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN26 */
#define IFX_INT_ACCEN_SRC_TOS70_EN26_OFF (26u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN27 */
#define IFX_INT_ACCEN_SRC_TOS70_EN27_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN27 */
#define IFX_INT_ACCEN_SRC_TOS70_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN27 */
#define IFX_INT_ACCEN_SRC_TOS70_EN27_OFF (27u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN28 */
#define IFX_INT_ACCEN_SRC_TOS70_EN28_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN28 */
#define IFX_INT_ACCEN_SRC_TOS70_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN28 */
#define IFX_INT_ACCEN_SRC_TOS70_EN28_OFF (28u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN29 */
#define IFX_INT_ACCEN_SRC_TOS70_EN29_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN29 */
#define IFX_INT_ACCEN_SRC_TOS70_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN29 */
#define IFX_INT_ACCEN_SRC_TOS70_EN29_OFF (29u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN2 */
#define IFX_INT_ACCEN_SRC_TOS70_EN2_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN2 */
#define IFX_INT_ACCEN_SRC_TOS70_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN2 */
#define IFX_INT_ACCEN_SRC_TOS70_EN2_OFF (2u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN30 */
#define IFX_INT_ACCEN_SRC_TOS70_EN30_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN30 */
#define IFX_INT_ACCEN_SRC_TOS70_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN30 */
#define IFX_INT_ACCEN_SRC_TOS70_EN30_OFF (30u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN31 */
#define IFX_INT_ACCEN_SRC_TOS70_EN31_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN31 */
#define IFX_INT_ACCEN_SRC_TOS70_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN31 */
#define IFX_INT_ACCEN_SRC_TOS70_EN31_OFF (31u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN3 */
#define IFX_INT_ACCEN_SRC_TOS70_EN3_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN3 */
#define IFX_INT_ACCEN_SRC_TOS70_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN3 */
#define IFX_INT_ACCEN_SRC_TOS70_EN3_OFF (3u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN4 */
#define IFX_INT_ACCEN_SRC_TOS70_EN4_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN4 */
#define IFX_INT_ACCEN_SRC_TOS70_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN4 */
#define IFX_INT_ACCEN_SRC_TOS70_EN4_OFF (4u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN5 */
#define IFX_INT_ACCEN_SRC_TOS70_EN5_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN5 */
#define IFX_INT_ACCEN_SRC_TOS70_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN5 */
#define IFX_INT_ACCEN_SRC_TOS70_EN5_OFF (5u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN6 */
#define IFX_INT_ACCEN_SRC_TOS70_EN6_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN6 */
#define IFX_INT_ACCEN_SRC_TOS70_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN6 */
#define IFX_INT_ACCEN_SRC_TOS70_EN6_OFF (6u)

