Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_bf.h
/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN7 */
#define IFX_INT_ACCEN_SRC_TOS70_EN7_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN7 */
#define IFX_INT_ACCEN_SRC_TOS70_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN7 */
#define IFX_INT_ACCEN_SRC_TOS70_EN7_OFF (7u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN8 */
#define IFX_INT_ACCEN_SRC_TOS70_EN8_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN8 */
#define IFX_INT_ACCEN_SRC_TOS70_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN8 */
#define IFX_INT_ACCEN_SRC_TOS70_EN8_OFF (8u)

/** \brief  Length for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN9 */
#define IFX_INT_ACCEN_SRC_TOS70_EN9_LEN (1u)

/** \brief  Mask for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN9 */
#define IFX_INT_ACCEN_SRC_TOS70_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ACCEN_SRC_TOS70_Bits.EN9 */
#define IFX_INT_ACCEN_SRC_TOS70_EN9_OFF (9u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.ECC */
#define IFX_INT_ICU_ECR_ECC_LEN (5u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.ECC */
#define IFX_INT_ICU_ECR_ECC_MSK (0x1fu)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.ECC */
#define IFX_INT_ICU_ECR_ECC_OFF (10u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.EOV */
#define IFX_INT_ICU_ECR_EOV_LEN (1u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.EOV */
#define IFX_INT_ICU_ECR_EOV_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.EOV */
#define IFX_INT_ICU_ECR_EOV_OFF (30u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.ID */
#define IFX_INT_ICU_ECR_ID_LEN (10u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.ID */
#define IFX_INT_ICU_ECR_ID_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.ID */
#define IFX_INT_ICU_ECR_ID_OFF (16u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.PN */
#define IFX_INT_ICU_ECR_PN_LEN (8u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.PN */
#define IFX_INT_ICU_ECR_PN_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.PN */
#define IFX_INT_ICU_ECR_PN_OFF (0u)

/** \brief  Length for Ifx_INT_ICU_ECR_Bits.STAT */
#define IFX_INT_ICU_ECR_STAT_LEN (1u)

/** \brief  Mask for Ifx_INT_ICU_ECR_Bits.STAT */
#define IFX_INT_ICU_ECR_STAT_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ICU_ECR_Bits.STAT */
#define IFX_INT_ICU_ECR_STAT_OFF (31u)

/** \brief  Length for Ifx_INT_ICU_LASR_Bits.ECC */
#define IFX_INT_ICU_LASR_ECC_LEN (5u)

/** \brief  Mask for Ifx_INT_ICU_LASR_Bits.ECC */
#define IFX_INT_ICU_LASR_ECC_MSK (0x1fu)

/** \brief  Offset for Ifx_INT_ICU_LASR_Bits.ECC */
#define IFX_INT_ICU_LASR_ECC_OFF (10u)

/** \brief  Length for Ifx_INT_ICU_LASR_Bits.ID */
#define IFX_INT_ICU_LASR_ID_LEN (10u)

/** \brief  Mask for Ifx_INT_ICU_LASR_Bits.ID */
#define IFX_INT_ICU_LASR_ID_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_ICU_LASR_Bits.ID */
#define IFX_INT_ICU_LASR_ID_OFF (16u)

/** \brief  Length for Ifx_INT_ICU_LASR_Bits.PN */
#define IFX_INT_ICU_LASR_PN_LEN (8u)

/** \brief  Mask for Ifx_INT_ICU_LASR_Bits.PN */
#define IFX_INT_ICU_LASR_PN_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ICU_LASR_Bits.PN */
#define IFX_INT_ICU_LASR_PN_OFF (0u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.ECC */
#define IFX_INT_ICU_LWSR_ECC_LEN (5u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.ECC */
#define IFX_INT_ICU_LWSR_ECC_MSK (0x1fu)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.ECC */
#define IFX_INT_ICU_LWSR_ECC_OFF (10u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.ID */
#define IFX_INT_ICU_LWSR_ID_LEN (10u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.ID */
#define IFX_INT_ICU_LWSR_ID_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.ID */
#define IFX_INT_ICU_LWSR_ID_OFF (16u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.PN */
#define IFX_INT_ICU_LWSR_PN_LEN (8u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.PN */
#define IFX_INT_ICU_LWSR_PN_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.PN */
#define IFX_INT_ICU_LWSR_PN_OFF (0u)

/** \brief  Length for Ifx_INT_ICU_LWSR_Bits.STAT */
#define IFX_INT_ICU_LWSR_STAT_LEN (1u)

/** \brief  Mask for Ifx_INT_ICU_LWSR_Bits.STAT */
#define IFX_INT_ICU_LWSR_STAT_MSK (0x1u)

/** \brief  Offset for Ifx_INT_ICU_LWSR_Bits.STAT */
#define IFX_INT_ICU_LWSR_STAT_OFF (31u)

/** \brief  Length for Ifx_INT_ID_Bits.MOD_NUMBER */
#define IFX_INT_ID_MOD_NUMBER_LEN (16u)

/** \brief  Mask for Ifx_INT_ID_Bits.MOD_NUMBER */
#define IFX_INT_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_ID_Bits.MOD_NUMBER */
#define IFX_INT_ID_MOD_NUMBER_OFF (16u)

/** \brief  Length for Ifx_INT_ID_Bits.MOD_REV */
#define IFX_INT_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_INT_ID_Bits.MOD_REV */
#define IFX_INT_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ID_Bits.MOD_REV */
#define IFX_INT_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_INT_ID_Bits.MOD_TYPE */
#define IFX_INT_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_INT_ID_Bits.MOD_TYPE */
#define IFX_INT_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_INT_ID_Bits.MOD_TYPE */
#define IFX_INT_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_LEN (1u)

/** \brief  Mask for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_MSK (0x1u)

/** \brief  Offset for Ifx_INT_OIT_Bits.OE0 */
#define IFX_INT_OIT_OE0_OFF (7u)

/** \brief  Length for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_LEN (1u)

/** \brief  Mask for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_MSK (0x1u)

/** \brief  Offset for Ifx_INT_OIT_Bits.OE1 */
#define IFX_INT_OIT_OE1_OFF (15u)

/** \brief  Length for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_LEN (3u)

/** \brief  Mask for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_MSK (0x7u)

/** \brief  Offset for Ifx_INT_OIT_Bits.TOS0 */
#define IFX_INT_OIT_TOS0_OFF (0u)

/** \brief  Length for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_LEN (3u)

/** \brief  Mask for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_MSK (0x7u)

/** \brief  Offset for Ifx_INT_OIT_Bits.TOS1 */
#define IFX_INT_OIT_TOS1_OFF (8u)

/** \brief  Length for Ifx_INT_OIXMS_Bits.MIRQ */
#define IFX_INT_OIXMS_MIRQ_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXMS_Bits.MIRQ */
#define IFX_INT_OIXMS_MIRQ_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXMS_Bits.MIRQ */
#define IFX_INT_OIXMS_MIRQ_OFF (0u)

