Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_bf.h
/** \brief  Length for Ifx_INT_OIXS0_Bits.IRQ0 */
#define IFX_INT_OIXS0_IRQ0_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS0_Bits.IRQ0 */
#define IFX_INT_OIXS0_IRQ0_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS0_Bits.IRQ0 */
#define IFX_INT_OIXS0_IRQ0_OFF (0u)

/** \brief  Length for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS0_Bits.IRQ1 */
#define IFX_INT_OIXS0_IRQ1_OFF (16u)

/** \brief  Length for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS1_Bits.IRQ2 */
#define IFX_INT_OIXS1_IRQ2_OFF (0u)

/** \brief  Length for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_LEN (10u)

/** \brief  Mask for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_MSK (0x3ffu)

/** \brief  Offset for Ifx_INT_OIXS1_Bits.IRQ3 */
#define IFX_INT_OIXS1_IRQ3_OFF (16u)

/** \brief  Length for Ifx_INT_OIXTS_Bits.OBS */
#define IFX_INT_OIXTS_OBS_LEN (2u)

/** \brief  Mask for Ifx_INT_OIXTS_Bits.OBS */
#define IFX_INT_OIXTS_OBS_MSK (0x3u)

/** \brief  Offset for Ifx_INT_OIXTS_Bits.OBS */
#define IFX_INT_OIXTS_OBS_OFF (8u)

/** \brief  Length for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_LEN (2u)

/** \brief  Mask for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_OFF (0u)

/** \brief  Length for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_LEN (16u)

/** \brief  Mask for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_OFF (0u)

/** \brief  Length for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_LEN (16u)

/** \brief  Mask for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_OFF (16u)

/** \brief  Length for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_LEN (16u)

/** \brief  Mask for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_OFF (0u)

/** \brief  Length for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_LEN (16u)

/** \brief  Mask for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_OFF (16u)

/** \brief  Length for Ifx_INT_OOBS_Bits.OTGB0 */
#define IFX_INT_OOBS_OTGB0_LEN (16u)

/** \brief  Mask for Ifx_INT_OOBS_Bits.OTGB0 */
#define IFX_INT_OOBS_OTGB0_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_OOBS_Bits.OTGB0 */
#define IFX_INT_OOBS_OTGB0_OFF (0u)

/** \brief  Length for Ifx_INT_OOBS_Bits.OTGB1 */
#define IFX_INT_OOBS_OTGB1_LEN (16u)

/** \brief  Mask for Ifx_INT_OOBS_Bits.OTGB1 */
#define IFX_INT_OOBS_OTGB1_MSK (0xffffu)

/** \brief  Offset for Ifx_INT_OOBS_Bits.OTGB1 */
#define IFX_INT_OOBS_OTGB1_OFF (16u)

/** \brief  Length for Ifx_INT_OSSIC_Bits.TGB */
#define IFX_INT_OSSIC_TGB_LEN (1u)

/** \brief  Mask for Ifx_INT_OSSIC_Bits.TGB */
#define IFX_INT_OSSIC_TGB_MSK (0x1u)

/** \brief  Offset for Ifx_INT_OSSIC_Bits.TGB */
#define IFX_INT_OSSIC_TGB_OFF (2u)

/** \brief  Length for Ifx_INT_OSSIC_Bits.TGS */
#define IFX_INT_OSSIC_TGS_LEN (2u)

/** \brief  Mask for Ifx_INT_OSSIC_Bits.TGS */
#define IFX_INT_OSSIC_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_INT_OSSIC_Bits.TGS */
#define IFX_INT_OSSIC_TGS_OFF (0u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG0 */
#define IFX_INT_SRB_TRIG0_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG0 */
#define IFX_INT_SRB_TRIG0_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG0 */
#define IFX_INT_SRB_TRIG0_OFF (0u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG1 */
#define IFX_INT_SRB_TRIG1_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG1 */
#define IFX_INT_SRB_TRIG1_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG1 */
#define IFX_INT_SRB_TRIG1_OFF (1u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG2 */
#define IFX_INT_SRB_TRIG2_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG2 */
#define IFX_INT_SRB_TRIG2_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG2 */
#define IFX_INT_SRB_TRIG2_OFF (2u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG3 */
#define IFX_INT_SRB_TRIG3_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG3 */
#define IFX_INT_SRB_TRIG3_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG3 */
#define IFX_INT_SRB_TRIG3_OFF (3u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG4 */
#define IFX_INT_SRB_TRIG4_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG4 */
#define IFX_INT_SRB_TRIG4_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG4 */
#define IFX_INT_SRB_TRIG4_OFF (4u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG5 */
#define IFX_INT_SRB_TRIG5_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG5 */
#define IFX_INT_SRB_TRIG5_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG5 */
#define IFX_INT_SRB_TRIG5_OFF (5u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG6 */
#define IFX_INT_SRB_TRIG6_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG6 */
#define IFX_INT_SRB_TRIG6_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG6 */
#define IFX_INT_SRB_TRIG6_OFF (6u)

/** \brief  Length for Ifx_INT_SRB_Bits.TRIG7 */
#define IFX_INT_SRB_TRIG7_LEN (1u)

/** \brief  Mask for Ifx_INT_SRB_Bits.TRIG7 */
#define IFX_INT_SRB_TRIG7_MSK (0x1u)

/** \brief  Offset for Ifx_INT_SRB_Bits.TRIG7 */
#define IFX_INT_SRB_TRIG7_OFF (7u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXINT_BF_H */
